In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_excel("vehicle.xlsx")
df.head()

,name,company,year,Price,kms_driven,fuel_type,platform
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol,Quikr
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel,Quikr
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol,Quikr
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol,Quikr
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel,Quikr

In [3]:
df.describe()

              name company  year          Price  kms_driven fuel_type platform
count          892     892   892            892         840       837      892
unique         525      48    61            274         258         3        8
top     Honda City  Maruti  2015  Ask For Price  45,000 kms    Petrol  CarWale
freq            13     235   117             35          30       440      241

In [4]:
df.shape

(892, 7)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
 6   platform    892 non-null    object
dtypes: object(7)
memory usage: 48.9+ KB

In [6]:
df.isnull().sum()

name           0
company        0
year           0
Price          0
kms_driven    52
fuel_type     55
platform       0
dtype: int64

### Data Exploration
- year has many values which do not make any sense
- convert year from obj to int
- remove "Ask for price" from price column
- remove commas from the price column
- convert price from obj to int
- remove kms and commas from the kms_driven column
- convert kms_driven from obj to int
- deal with nan values in kms_driven column
- deal with nan values in fuel type
- keep the first 3 words from the name column so that we can make them as categorical variables

### Cleaning

In [7]:
backup_df = df.copy()
backup_df.head()

,name,company,year,Price,kms_driven,fuel_type,platform
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol,Quikr
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel,Quikr
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol,Quikr
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol,Quikr
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel,Quikr

In [8]:
# Having only numeric values in the year column
df = df[df['year'].str.isnumeric()]
df.head()

,name,company,year,Price,kms_driven,fuel_type,platform
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol,Quikr
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel,Quikr
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol,Quikr
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol,Quikr
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel,Quikr

In [9]:
# Converting the year column from obj to int
df.year = df.year.astype(int)

In [10]:
df[df.Price == 'Ask For Price'].count()

name          23
company       23
year          23
Price         23
kms_driven    21
fuel_type     21
platform      23
dtype: int64

In [11]:
# Dropping all the rows having the value of Price as 'Ask For Price'
df = df[df.Price != 'Ask For Price']

In [12]:
# Removing commas and converting Price column from obj to int
df.Price = df.Price.str.replace(',','').astype(int)

In [13]:
# Removing kms and commas from kms_driven column
df.kms_driven = df.kms_driven.str.split(' ').str.get(0).str.replace(',','')

In [14]:
df = df[df.kms_driven.str.isnumeric()]
df.head()

,name,company,year,Price,kms_driven,fuel_type,platform
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,80000,45000,Petrol,Quikr
1,Mahindra Jeep CL550 MDI,Mahindra,2006,425000,40,Diesel,Quikr
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,325000,28000,Petrol,Quikr
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,575000,36000,Diesel,Quikr
6,Ford Figo,Ford,2012,175000,41000,Diesel,Quikr

In [15]:
df.kms_driven = df.kms_driven.astype(int)

In [16]:
# Counting all the nan values in the column fuel_type
df.fuel_type.isnull().sum()

1

In [17]:
# Dropping all the rows containing nan values
df = df.dropna()

In [18]:
# Picking the first 3 words from the name column
df.name = df.name.str.split(" ").str.slice(0,3).str.join(" ")

In [19]:
df = df.reset_index(drop=True)

In [20]:
df.sample(5)

,name,company,year,Price,kms_driven,fuel_type,platform
373,Toyota Etios,Toyota,2011,275000,36000,Diesel,CarDekho
679,Hyundai Eon D,Hyundai,2018,280000,35000,Petrol,CarWale
138,Volkswagen Polo Comfortline,Volkswagen,2015,399999,2800,Petrol,OLX
398,Hyundai Creta 1.6,Hyundai,2016,950000,25000,Petrol,CarDekho
791,Toyota Qualis,Toyota,2003,180000,100000,Diesel,CarTrade

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
 6   platform    816 non-null    object
dtypes: int32(3), object(4)
memory usage: 35.2+ KB

In [22]:
df.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [23]:
# Here we see that there is an outlier where the max car price of a car is 85L
df = df[df.Price < 6e6].reset_index(drop=True)

In [24]:
# Storing the cleaned data into a new data frame
cleaned_df = df.copy()
cleaned_df.shape

(815, 7)

### Model

In [25]:
# Dividing the input dataset and output dataset
X = df.drop(['Price'], axis=1)
y = df.Price

In [26]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
from sklearn.linear_model import LinearRegression
from sklearn.pipeline import make_pipeline
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score

In [27]:
ohe = OneHotEncoder()
ohe.fit(X[['name','company','fuel_type','platform']])

OneHotEncoder()

In [28]:
transformer = ColumnTransformer(transformers=[
    ('tnf1',OneHotEncoder(categories=ohe.categories_, drop='first', sparse=False), ['name','company','fuel_type','platform'])
], remainder='passthrough')

In [29]:
lr = LinearRegression()

In [30]:
scores = []
for i in range(1000):
    X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=i,test_size=0.2)
    pipe = make_pipeline(transformer, lr)
    pipe.fit(X_train,y_train)
    y_pred = pipe.predict(X_test)
    scores.append(r2_score(y_test,y_pred))

In [31]:
# Finding the optimum value of random state so that we can get a higher accurate model
np.argmax(scores)

443

In [32]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=np.argmax(scores),test_size=0.2)

In [33]:
pipe = make_pipeline(transformer, lr)

In [34]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('tnf1',
                                                  OneHotEncoder(categories=[array(['Audi A3 Cabriolet', 'Audi A4 1.8', 'Audi A4 2.0', 'Audi A6 2.0',
       'Audi A8', 'Audi Q3 2.0', 'Audi Q5 2.0', 'Audi Q7', 'BMW 3 Series',
       'BMW 5 Series', 'BMW 7 Series', 'BMW X1', 'BMW X1 sDrive20d',
       'BMW X1 xDrive20d', 'Chevrolet Beat', 'Chevrolet Beat Diesel',
       '...
       'Mahindra', 'Maruti', 'Mercedes', 'Mini', 'Mitsubishi', 'Nissan',
       'Renault', 'Skoda', 'Tata', 'Toyota', 'Volkswagen', 'Volvo'],
      dtype=object),
                                                                            array(['Diesel', 'LPG', 'Petrol'], dtype=object),
                                                                            array(['CarDekho', 'CarTrade', 'CarWale', 'Droom', 'OLA', 'OLX', 'Quikr',
       'SteerAuto'], dtype=object)],
                                                                drop='first',
                                                                sparse=False),
                                                  ['name', 'company',
                                                   'fuel_type',
                                                   'platform'])])),
                ('linearregression', LinearRegression())])

In [35]:
y_pred = pipe.predict(X_test)

In [36]:
r2_score(y_test,y_pred)

0.8710839623131609

In [42]:
for plat_name in df.platform.unique():
    price = pipe.predict(pd.DataFrame(columns=['name','company','year','kms_driven','fuel_type','platform'],data=np.array(['Maruti Suzuki Swift','Maruti',2019,100,'Petrol',str(plat_name)]).reshape(1,6)))
    print(plat_name+':',round(*price, 3))

Quikr: 407245.332
CarTrade: 390205.381
OLX: 417557.417
CarDekho: 416141.092
OLA: 399050.951
Droom: 416299.411
CarWale: 451883.666
SteerAuto: 396501.548